[
  { 
    "_id":1,
    "image": "https://i.ibb.co/w42LP4H/luke-chesser-JKUTr-J4v-K00-unsplash.jpg",
    "topic": "Data Engineering",
    "name": "Data science",
    "details": "Data science is a multidisciplinary field that involves the use of statistical, mathematical, and computer science techniques to extract insights and knowledge from data. Data science has become increasingly important in recent years as the amount of data generated by businesses and organizations has grown exponentially.The data science process typically involves several stages, including data collection, data cleaning, data transformation, data analysis, and data visualization. Each stage requires specialized skills and tools, and data scientists often work in teams to complete the process efficiently and effectively.",
    "rating": 4.5
  },
  { 
    "_id":2,
    "image": "https://i.ibb.co/1d5RqHh/yancy-min-842of-HC6-Ma-I-unsplash.jpg",
    "topic": "Web dev",
    "name": "Web Development",
    "details": "Web development is the process of creating websites and web applications that are accessible over the internet. It involves several disciplines, including web design, programming, and database management. The goal of web development is to create functional, user-friendly websites that provide an enjoyable and engaging user experience. The process of web development typically begins with planning and design. Web developers work with clients to understand their needs and goals for the website, and then create a design that meets those requirements. The design phase may include creating wireframes, mockups, and prototypes to give clients a visual representation of the final product.",
    "rating": 3.5
  },
  { 
    "_id":3,
    "image": "https://i.ibb.co/RSnr0Kg/alvaro-reyes-zvm-Ziw3vds-Q-unsplash.jpg",
    "topic": "Design",
    "name": "Ux & Ui",
    "details": "UI (User Interface) and UX (User Experience) are two essential components of modern design that focus on creating intuitive and engaging digital products. UI refers to the visual and interactive elements of a product, while UX focuses on the overall experience a user has while interacting with that product.UI design is all about creating a visually appealing and easy-to-use interface that users can interact with. UI designers work to create a layout, color scheme, typography, and other visual elements that are consistent and aesthetically pleasing. They also consider how users will interact with the product, creating intuitive navigation and clear calls-to-action.",
    "rating": 4.8
  },
  { 
    "_id":4,
    "image": "https://i.ibb.co/Vwtw6Hk/maxresdefault-3.jpg",
    "topic": "Physics",
    "name": "Thermodynamics",
    "details": "Thermodynamics is a branch of physics that studies the relationships between heat, energy, temperature, and work. It is a fundamental area of study that has applications in many fields, including engineering, chemistry, and biology.The study of thermodynamics is based on a set of laws that govern how energy is transferred and transformed in physical systems. The first law of thermodynamics, also known as the law of conservation of energy, states that energy cannot be created or destroyed, only transformed from one form to another. The second law of thermodynamics states that the total entropy of a closed system will always increase over time.",
    "rating": 4.6
  },
  { 
    "_id":5,
    "image": "https://i.ibb.co/FH1nrcF/81-21-Fk2-Tb-L-RI.jpg",
    "topic": "Physics",
    "name": " Nuclear physics ",
    "details": "Nuclear physics is a branch of physics that studies the properties and behavior of atomic nuclei and their interactions with subatomic particles. It is a fundamental area of study that has applications in many fields, including energy generation, medicine, and materials science.One of the primary areas of focus in nuclear physics is the study of nuclear reactions, which involve changes in the composition or structure of atomic nuclei. Nuclear reactions can be induced by a variety of means, including particle accelerators, radioactive decay, and natural processes like fusion in the sun.",
    "rating": 4.7
  },
  { 
    "_id":6,
    "image": "https://i.ibb.co/QD4LTc1/cuspical-elliptic-curve.png",
    "topic": "Math",
    "name": " Algebraic geometry",
    "details": "Algebraic geometry is a branch of mathematics that studies the properties and structures of algebraic equations and their geometric representations. It is a field that uses abstract algebraic concepts to study the geometry of objects, such as curves, surfaces, and higher-dimensional varieties.One of the primary objects of study in algebraic geometry is the algebraic variety, which is a geometric object defined by a set of polynomial equations. The study of algebraic varieties involves using algebraic techniques to understand their geometric properties and vice versa.",
    "rating": 3.2
  }
]
